Feature: Examples of using meta-modifiers like @variable, @call and @understand

Scenario: @variable usages
    Given the following Patterns
    | Id | Pattern                                  | Meaning                                     |
    |----|------------------------------------------|---------------------------------------------|
    | 1  | ботинок находится на ∥(одной, другой)    | находиться(ботинок, @variable(∥, сторона)), |
    |    | стороне лужи                             | сторона(лужа, @variable(∥, сторона))        |
    |----| -----------------------------------------| --------------------------------------------|
    Then the following understandings should be possible
    | Sentence                                      | Meaning                       |
    |-----------------------------------------------|-------------------------------|
    | медведь лежит на одном береге реки            | лежать(медведь, ОдинБерег),   |
    |                                               | берег(река, ОдинБерег)        |
    |-----------------------------------------------|-------------------------------|
Scenario: Complex usage of several meta-modifiers
    Given the following Patterns
    | Id | Pattern                                                    | Meaning                               |
    |----|------------------------------------------------------------|---------------------------------------|
    | 6  | крестьянин{и проч.} покоится{мн.} на внешней поверхности   | покоиться(крестьянин, на, X),         |
    |    | кубика                                                     | поверхность(кубик, X),                |
    |    |                                                            | X = внешний                           |
    |----|------------------------------------------------------------|---------------------------------------|
    | 7  | ~В ∥(начальном, исходном) состоянии~ 'state-description'   | @call(                                |
    |    |                                                            |   @variable(∥, состояние),            |
    |    |                                                            |   [@understand('state-description')]).|
    |----|------------------------------------------------------------|---------------------------------------|
    Then the following understandings should be possible
    | Sentence                                           | Meaning                         | Recognized with Pattern |
    |----------------------------------------------------|---------------------------------|-------------------------|
    | В исходном состоянии 'фермер, волк, коза и капуста |  исходныйСостояние([            |       7-исходном        |
    | находятся на левом береге реки'                    |     находиться(фермер, на, X),  |                         |
    |                                                    |     находиться(волк, на, X),    |                         |
    |                                                    |     находиться(коза, на, X),    |                         |
    |                                                    |     находиться(капуста, на, X), |                         |
    |                                                    |     берег(река, X),             |                         |
    |                                                    |     X = левый]).                |                         |
    |----------------------------------------------------|---------------------------------|-------------------------|
    And the following sentences should fail to be understood
    | Sentence                                                                            |
    | В стартовом состоянии 'фермер, волк, коза и капуста находятся на левом береге реки' |


Scenario: Из quotation, которая передается в @understand, не должны удалятся вложенные quotations
   Given the following Patterns
    | Id  | Pattern                                               | Meaning                                                   |
    | ----| ------------------------------------------------------| ----------------------------------------------------------|
    | 1   | ~если~ 'условие', ~то~ 'cледствие'                    | @understand('cледствие') :-                               |
    |     |                                                       |                    @understand('условие').                |
    |-----|-------------------------------------------------------|-----------------------------------------------------------|
    | 2   | подать любую строку на вход                           | податьНа(Строка, вход)                                    |
    |-----|-------------------------------------------------------|-----------------------------------------------------------|
    | 3   | причиним вред 'точное наименование вреда'             | причинить(вред, 'точное наименование вреда')              |
    | ----| ------------------------------------------------------| ----------------------------------------------------------|
    Then the following understandings should be possible
    | Sentence                                           | Meaning                                                            |
    |----------------------------------------------------|-------------------------------------------|
    | поделить любое число на ноль                       | поделитьНа(Число, ноль)                   |
    |----------------------------------------------------|-------------------------------------------|
    | если поделить любое число на ноль, то получим      | получить(ошибка, 'так делать нельзя') :-  |
    | ошибку 'так делать нельзя'                         |        поделитьНа(Число, ноль).           |
    |----------------------------------------------------|-------------------------------------------|
